A.class
-------

Summary:
Schema => SemanticDB v3
Uri => A.class
Text => empty
Language => Scala
Symbols => 5 entries

Symbols:
_empty_. => package _empty_
_empty_.A# => class A.{+2 decls}
  extends AnyRef
_empty_.A#`<init>`(). => primary ctor <init>: (): A
  A => _empty_.A#
_empty_.A#b(). => method b: : B
  B => _empty_.B#
_root_. => package _root_

B.class
-------

Summary:
Schema => SemanticDB v3
Uri => B.class
Text => empty
Language => Scala
Symbols => 5 entries

Symbols:
_empty_. => package _empty_
_empty_.B# => class B.{+2 decls}
  extends AnyRef
_empty_.B#`<init>`(). => primary ctor <init>: (): B
  B => _empty_.B#
_empty_.B#a(). => method a: : A
  A => _empty_.A#
_root_. => package _root_

com/javacp/ClassSuffix.class
----------------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/ClassSuffix.class
Text => empty
Language => Java
Symbols => 14 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.ClassSuffix# => class ClassSuffix.{+3 decls}
  extends Object
com.javacp.ClassSuffix#Inner# => private[javacp] class Inner[A <: Object].{+2 decls}
  extends Object
com.javacp.ClassSuffix#Inner#Bar# => private[javacp] class Bar.{+2 decls}
  extends Object
com.javacp.ClassSuffix#Inner#Bar#Fuz# => private[javacp] class Fuz[B <: Object].{+1 decls}
  extends Object
com.javacp.ClassSuffix#Inner#Bar#Fuz#[B] => typeparam B: <: Object
  Object => java.lang.Object#
com.javacp.ClassSuffix#Inner#Bar#Fuz#`<init>`(Bar). => private[javacp] ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.ClassSuffix#Inner#Bar#`<init>`(Inner). => private[javacp] ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.ClassSuffix#Inner#[A] => typeparam A: <: Object
  Object => java.lang.Object#
com.javacp.ClassSuffix#Inner#`<init>`(ClassSuffix). => private[javacp] ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.ClassSuffix#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.ClassSuffix#suffix. => field suffix: Inner[String]#Bar#Fuz[Integer]
  Inner => com.javacp.ClassSuffix#Inner#
  String => java.lang.String#
  Bar => Bar#
  Fuz => Fuz#
  Integer => java.lang.Integer#

com/javacp/Coin.class
---------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/Coin.class
Text => empty
Language => Java
Symbols => 17 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.Coin# => final enum class Coin.{+11 decls}
  extends Enum[Coin]
com.javacp.Coin#$VALUES. => private final static field $VALUES: Array[Coin]
  Array => scala.Array#
  Coin => com.javacp.Coin#
com.javacp.Coin#<clinit>(). => private[javacp] static method <clinit>: (): Unit
  Unit => scala.Unit#
com.javacp.Coin#DIME. => final static enum field DIME: Coin
  Coin => com.javacp.Coin#
com.javacp.Coin#NICKEL. => final static enum field NICKEL: Coin
  Coin => com.javacp.Coin#
com.javacp.Coin#PENNY. => final static enum field PENNY: Coin
  Coin => com.javacp.Coin#
com.javacp.Coin#QUARTER. => final static enum field QUARTER: Coin
  Coin => com.javacp.Coin#
com.javacp.Coin#`<init>`(Int). => private ctor <init>: ($enum$name: Int): Unit
  $enum$name => com.javacp.Coin#`<init>`(Int).($enum$name)
  Int => scala.Int#
  Unit => scala.Unit#
com.javacp.Coin#`<init>`(Int).($enum$name) => param $enum$name: Int
  Int => scala.Int#
com.javacp.Coin#value(). => method value: (): Int
  Int => scala.Int#
com.javacp.Coin#value. => private final field value: Int
  Int => scala.Int#
com.javacp.Coin#valueOf(String). => static method valueOf: (name: String): Coin
  name => com.javacp.Coin#valueOf(String).(name)
  String => java.lang.String#
  Coin => com.javacp.Coin#
com.javacp.Coin#valueOf(String).(name) => param name: String
  String => java.lang.String#
com.javacp.Coin#values(). => static method values: (): Array[Coin]
  Array => scala.Array#
  Coin => com.javacp.Coin#

com/javacp/Interface.class
--------------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/Interface.class
Text => empty
Language => Java
Symbols => 4 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.Interface# => abstract interface Interface
  extends Object

com/javacp/Logger.class
-----------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/Logger.class
Text => empty
Language => Java
Symbols => 5 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.Logger# => class Logger.{+1 decls}
  extends Object
com.javacp.Logger#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#

com/javacp/MetacJava.class
--------------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/MetacJava.class
Text => empty
Language => Java
Symbols => 31 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.MetacJava# => class MetacJava.{+8 decls}
  extends Object
com.javacp.MetacJava#Overload1# => class Overload1.{+2 decls}
  extends Object
com.javacp.MetacJava#Overload1#A# => class A.{+1 decls}
  extends Object
com.javacp.MetacJava#Overload1#A#`<init>`(Overload1). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#Overload1#`<init>`(MetacJava). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#Overload2# => class Overload2.{+2 decls}
  extends Object
com.javacp.MetacJava#Overload2#A# => class A.{+1 decls}
  extends Object
com.javacp.MetacJava#Overload2#A#`<init>`(Overload2). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#Overload2#`<init>`(MetacJava). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#Overload3# => static class Overload3.{+2 decls}
  extends Object
com.javacp.MetacJava#Overload3#A# => static class A.{+1 decls}
  extends Object
com.javacp.MetacJava#Overload3#A#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#Overload3#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#StaticInner# => static class StaticInner.{+4 decls}
  extends Object
com.javacp.MetacJava#StaticInner#NonStatic# => class NonStatic.{+2 decls}
  extends Object
com.javacp.MetacJava#StaticInner#NonStatic#`<init>`(StaticInner). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#StaticInner#NonStatic#method(NonStatic). => method method: (e: NonStatic): Unit
  e => com.javacp.MetacJava#StaticInner#NonStatic#method(NonStatic).(e)
  NonStatic => com.javacp.MetacJava#StaticInner#NonStatic#
  Unit => scala.Unit#
com.javacp.MetacJava#StaticInner#NonStatic#method(NonStatic).(e) => param e: NonStatic
  NonStatic => com.javacp.MetacJava#StaticInner#NonStatic#
com.javacp.MetacJava#StaticInner#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#StaticInner#isNotStatic(). => method isNotStatic: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#StaticInner#isStatic(). => static method isStatic: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.MetacJava#overload(A+1). => method overload: (a: A): Unit
  a => com.javacp.MetacJava#overload(A+1).(a)
  A => com.javacp.MetacJava#Overload1#A#
  Unit => scala.Unit#
com.javacp.MetacJava#overload(A+1).(a) => param a: A
  A => com.javacp.MetacJava#Overload1#A#
com.javacp.MetacJava#overload(A+2). => method overload: (a: A): Unit
  a => com.javacp.MetacJava#overload(A+2).(a)
  A => com.javacp.MetacJava#Overload2#A#
  Unit => scala.Unit#
com.javacp.MetacJava#overload(A+2).(a) => param a: A
  A => com.javacp.MetacJava#Overload2#A#
com.javacp.MetacJava#overload(A+3). => static method overload: (a: A): Unit
  a => com.javacp.MetacJava#overload(A+3).(a)
  A => com.javacp.MetacJava#Overload3#A#
  Unit => scala.Unit#
com.javacp.MetacJava#overload(A+3).(a) => param a: A
  A => com.javacp.MetacJava#Overload3#A#

com/javacp/NonGeneric.class
---------------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/NonGeneric.class
Text => empty
Language => Java
Symbols => 6 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.NonGeneric# => class NonGeneric.{+2 decls}
  extends Exception
  extends Serializable
  extends Flushable
com.javacp.NonGeneric#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.NonGeneric#flush(). => method flush: (): Unit
  Unit => scala.Unit#

com/javacp/Recursive.class
--------------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/Recursive.class
Text => empty
Language => Java
Symbols => 16 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.Recursive# => abstract class Recursive[A <: Recursive[A, B] & Serializable, B <: Inner[A, B]].{+4 decls}
  extends Object
com.javacp.Recursive#Inner# => abstract static class Inner[A <: Recursive[A, B] & Serializable, B <: Inner[A, B]].{+1 decls}
  extends Object
com.javacp.Recursive#Inner#[A] => typeparam A: <: Recursive[A, B] & Serializable
  Recursive => com.javacp.Recursive#
  A => com.javacp.Recursive#Inner#[A]
  B => com.javacp.Recursive#Inner#[B]
  Serializable => java.io.Serializable#
com.javacp.Recursive#Inner#[B] => typeparam B: <: Inner[A, B]
  Inner => com.javacp.Recursive#Inner#
  A => com.javacp.Recursive#Inner#[A]
  B => com.javacp.Recursive#Inner#[B]
com.javacp.Recursive#Inner#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.Recursive#Inner2# => abstract class Inner2[C <: Comparable[C]].{+1 decls}
  extends Object
com.javacp.Recursive#Inner2#[C] => typeparam C: <: Comparable[C]
  Comparable => java.lang.Comparable#
  C => com.javacp.Recursive#Inner2#[C]
com.javacp.Recursive#Inner2#`<init>`(Recursive). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.Recursive#[A] => typeparam A: <: Recursive[A, B] & Serializable
  Recursive => com.javacp.Recursive#
  A => com.javacp.Recursive#[A]
  B => com.javacp.Recursive#[B]
  Serializable => java.io.Serializable#
com.javacp.Recursive#[B] => typeparam B: <: Inner[A, B]
  Inner => com.javacp.Recursive#Inner#
  A => com.javacp.Recursive#[A]
  B => com.javacp.Recursive#[B]
com.javacp.Recursive#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.Recursive#foo(). => method foo: [Anon <: Object] => (): ArrayList[Anon]
  Anon => com.javacp.Recursive#foo().[Anon]
  Object => java.lang.Object#
  ArrayList => java.util.ArrayList#
com.javacp.Recursive#foo().[Anon] => typeparam Anon: <: Object
  Object => java.lang.Object#

com/javacp/Test.class
---------------------

Summary:
Schema => SemanticDB v3
Uri => com/javacp/Test.class
Text => empty
Language => Java
Symbols => 66 entries

Symbols:
_root_. => package _root_
com. => package com
com.javacp. => package javacp
com.javacp.Test# => final class Test[A <: CharSequence & Serializable, B <: Object].{+34 decls}
  extends ArrayList[A]
  extends Comparable[B]
  extends Serializable
com.javacp.Test#Boolean. => field Boolean: Boolean
  Boolean => scala.Boolean#
com.javacp.Test#Byte. => field Byte: Byte
  Byte => scala.Byte#
com.javacp.Test#Char. => field Char: Char
  Char => scala.Char#
com.javacp.Test#Float. => field Float: Float
  Float => scala.Float#
com.javacp.Test#InnerShadowTypeParam# => private[javacp] class InnerShadowTypeParam[A <: Object].{+2 decls}
  extends Object
com.javacp.Test#InnerShadowTypeParam#[A] => typeparam A: <: Object
  Object => java.lang.Object#
com.javacp.Test#InnerShadowTypeParam#`<init>`(Test). => private[javacp] ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.Test#InnerShadowTypeParam#move(A,B). => method move: (a: A, b: B): Unit
  a => com.javacp.Test#InnerShadowTypeParam#move(A,B).(a)
  A => com.javacp.Test#InnerShadowTypeParam#[A]
  b => com.javacp.Test#InnerShadowTypeParam#move(A,B).(b)
  B => com.javacp.Test#[B]
  Unit => scala.Unit#
com.javacp.Test#InnerShadowTypeParam#move(A,B).(a) => param a: A
  A => com.javacp.Test#InnerShadowTypeParam#[A]
com.javacp.Test#InnerShadowTypeParam#move(A,B).(b) => param b: B
  B => com.javacp.Test#[B]
com.javacp.Test#Int. => field Int: Int
  Int => scala.Int#
com.javacp.Test#Long. => field Long: Long
  Long => scala.Long#
com.javacp.Test#Short. => field Short: Short
  Short => scala.Short#
com.javacp.Test#StaticClass# => private[javacp] static class StaticClass.{+1 decls}
  extends Object
com.javacp.Test#StaticClass#`<init>`(). => private[javacp] ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.Test#[A] => typeparam A: <: CharSequence & Serializable
  CharSequence => java.lang.CharSequence#
  Serializable => java.io.Serializable#
com.javacp.Test#[B] => typeparam B: <: Object
  Object => java.lang.Object#
com.javacp.Test#`<init>`(). => ctor <init>: (): Unit
  Unit => scala.Unit#
com.javacp.Test#anonymous. => field anonymous: Serializable
  Serializable => java.io.Serializable#
com.javacp.Test#arrayField. => private[javacp] final field arrayField: Array[Int]
  Array => scala.Array#
  Int => scala.Int#
com.javacp.Test#arrayMethod(). => private[javacp] method arrayMethod: (): Array[Int]
  Array => scala.Array#
  Int => scala.Int#
com.javacp.Test#compareTo(B). => final method compareTo: (b: B): Int
  b => com.javacp.Test#compareTo(B).(b)
  B => com.javacp.Test#[B]
  Int => scala.Int#
com.javacp.Test#compareTo(B).(b) => param b: B
  B => com.javacp.Test#[B]
com.javacp.Test#genericField. => private[javacp] field genericField: ArrayList[A]
  ArrayList => java.util.ArrayList#
  A => com.javacp.Test#[A]
com.javacp.Test#genericMethod(). => private[javacp] method genericMethod: (): ArrayList[A]
  ArrayList => java.util.ArrayList#
  A => com.javacp.Test#[A]
com.javacp.Test#genericParams(A,B). => private[javacp] method genericParams: (a: A, b: B): Unit
  a => com.javacp.Test#genericParams(A,B).(a)
  A => com.javacp.Test#[A]
  b => com.javacp.Test#genericParams(A,B).(b)
  B => com.javacp.Test#[B]
  Unit => scala.Unit#
com.javacp.Test#genericParams(A,B).(a) => param a: A
  A => com.javacp.Test#[A]
com.javacp.Test#genericParams(A,B).(b) => param b: B
  B => com.javacp.Test#[B]
com.javacp.Test#methodTypeParams(C). => private[javacp] method methodTypeParams: [C <: Integer] => (c: C): Unit
  C => com.javacp.Test#methodTypeParams(C).[C]
  Integer => java.lang.Integer#
  c => com.javacp.Test#methodTypeParams(C).(c)
  Unit => scala.Unit#
com.javacp.Test#methodTypeParams(C).(c) => param c: C
  C => com.javacp.Test#methodTypeParams(C).[C]
com.javacp.Test#methodTypeParams(C).[C] => typeparam C: <: Integer
  Integer => java.lang.Integer#
com.javacp.Test#overload(Logger+1). => method overload: (a: Logger): Unit
  a => com.javacp.Test#overload(Logger+1).(a)
  Logger => java.util.logging.Logger#
  Unit => scala.Unit#
com.javacp.Test#overload(Logger+1).(a) => param a: Logger
  Logger => java.util.logging.Logger#
com.javacp.Test#overload(Logger+2). => method overload: (a: Logger): Unit
  a => com.javacp.Test#overload(Logger+2).(a)
  Logger => com.javacp.Logger#
  Unit => scala.Unit#
com.javacp.Test#overload(Logger+2).(a) => param a: Logger
  Logger => com.javacp.Logger#
com.javacp.Test#packagePrivateField. => private[javacp] field packagePrivateField: Int
  Int => scala.Int#
com.javacp.Test#packagePrivateMethod(). => private[javacp] method packagePrivateMethod: (): Unit
  Unit => scala.Unit#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char). => private[javacp] method primitiveParams: (a: Int, b: Long, c: Float, d: Double, e: Short, f: Byte, g: Boolean, h: Char): Unit
  a => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(a)
  Int => scala.Int#
  b => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(b)
  Long => scala.Long#
  c => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(c)
  Float => scala.Float#
  d => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(d)
  Double => scala.Double#
  e => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(e)
  Short => scala.Short#
  f => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(f)
  Byte => scala.Byte#
  g => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(g)
  Boolean => scala.Boolean#
  h => com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(h)
  Char => scala.Char#
  Unit => scala.Unit#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(a) => param a: Int
  Int => scala.Int#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(b) => param b: Long
  Long => scala.Long#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(c) => param c: Float
  Float => scala.Float#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(d) => param d: Double
  Double => scala.Double#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(e) => param e: Short
  Short => scala.Short#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(f) => param f: Byte
  Byte => scala.Byte#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(g) => param g: Boolean
  Boolean => scala.Boolean#
com.javacp.Test#primitiveParams(Int,Long,Float,Double,Short,Byte,Boolean,Char).(h) => param h: Char
  Char => scala.Char#
com.javacp.Test#privateField. => private field privateField: Int
  Int => scala.Int#
com.javacp.Test#privateMethod(). => private method privateMethod: (): Unit
  Unit => scala.Unit#
com.javacp.Test#protectedField. => protected field protectedField: Int
  Int => scala.Int#
com.javacp.Test#protectedMethod(). => protected method protectedMethod: (): Unit
  Unit => scala.Unit#
com.javacp.Test#publicField. => field publicField: Int
  Int => scala.Int#
com.javacp.Test#publicMethod(). => method publicMethod: (): Unit
  Unit => scala.Unit#
com.javacp.Test#staticField. => private[javacp] static field staticField: Int
  Int => scala.Int#
com.javacp.Test#staticMethod(). => private[javacp] static method staticMethod: (): Unit
  Unit => scala.Unit#
com.javacp.Test#typeParams(ArrayList,Hashtable). => private[javacp] method typeParams: (a: ArrayList[HashMap[A, Array[String]]], b: Hashtable[String, B]): Unit
  a => com.javacp.Test#typeParams(ArrayList,Hashtable).(a)
  ArrayList => java.util.ArrayList#
  HashMap => java.util.HashMap#
  A => com.javacp.Test#[A]
  Array => scala.Array#
  String => java.lang.String#
  b => com.javacp.Test#typeParams(ArrayList,Hashtable).(b)
  Hashtable => java.util.Hashtable#
  B => com.javacp.Test#[B]
  Unit => scala.Unit#
com.javacp.Test#typeParams(ArrayList,Hashtable).(a) => param a: ArrayList[HashMap[A, Array[String]]]
  ArrayList => java.util.ArrayList#
  HashMap => java.util.HashMap#
  A => com.javacp.Test#[A]
  Array => scala.Array#
  String => java.lang.String#
com.javacp.Test#typeParams(ArrayList,Hashtable).(b) => param b: Hashtable[String, B]
  Hashtable => java.util.Hashtable#
  String => java.lang.String#
  B => com.javacp.Test#[B]
com.javacp.Test#wildcard(ArrayList). => method wildcard: (wildcard: ArrayList[local_wildcard]): Unit
  wildcard => com.javacp.Test#wildcard(ArrayList).(wildcard)
  ArrayList => java.util.ArrayList#
  local_wildcard => local_wildcard
  Unit => scala.Unit#
com.javacp.Test#wildcard(ArrayList).(wildcard) => param wildcard: ArrayList[local_wildcard]
  ArrayList => java.util.ArrayList#
  local_wildcard => local_wildcard
com.javacp.Test#wildcard(Collection,Collection). => method wildcard: (a: Collection[Number], b: Collection[Number]): Unit
  a => com.javacp.Test#wildcard(Collection,Collection).(a)
  Collection => java.util.Collection#
  Number => java.lang.Number#
  b => com.javacp.Test#wildcard(Collection,Collection).(b)
  Unit => scala.Unit#
com.javacp.Test#wildcard(Collection,Collection).(a) => param a: Collection[Number]
  Collection => java.util.Collection#
  Number => java.lang.Number#
com.javacp.Test#wildcard(Collection,Collection).(b) => param b: Collection[Number]
  Collection => java.util.Collection#
  Number => java.lang.Number#

example/A.class
---------------

Summary:
Schema => SemanticDB v3
Uri => example/A.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
example. => package example
example.A# => trait A.{+1 decls}
  extends AnyRef
example.A#foo(). => abstract method foo: : Int
  Int => scala.Int#

example/Acc.class
-----------------

Summary:
Schema => SemanticDB v3
Uri => example/Acc.class
Text => empty
Language => Scala
Symbols => 11 entries

Symbols:
_root_. => package _root_
example. => package example
example.Acc# => class Acc.{+8 decls}
  extends AnyRef
example.Acc#`<init>`(). => primary ctor <init>: (): Acc
  Acc => example.Acc#
example.Acc#m1(). => private method m1: : Nothing
  Nothing => scala.Nothing#
example.Acc#m2(). => private[this] method m2: : Nothing
  Nothing => scala.Nothing#
example.Acc#m3(). => private[Acc] method m3: : Nothing
  Nothing => scala.Nothing#
example.Acc#m4(). => protected method m4: : Nothing
  Nothing => scala.Nothing#
example.Acc#m5(). => protected[this] method m5: : Nothing
  Nothing => scala.Nothing#
example.Acc#m6(). => protected[example] method m6: : Nothing
  Nothing => scala.Nothing#
example.Acc#m7(). => method m7: : Nothing
  Nothing => scala.Nothing#

example/B.class
---------------

Summary:
Schema => SemanticDB v3
Uri => example/B.class
Text => empty
Language => Scala
Symbols => 5 entries

Symbols:
_root_. => package _root_
example. => package example
example.B# => class B.{+2 decls}
  extends AnyRef
  extends A
example.B#`<init>`(). => primary ctor <init>: (): B
  B => example.B#
example.B#foo(). => method foo: : Int
  Int => scala.Int#

example/Example.class
---------------------

Summary:
Schema => SemanticDB v3
Uri => example/Example.class
Text => empty
Language => Scala
Symbols => 7 entries

Symbols:
_root_. => package _root_
example. => package example
example.Example. => final object Example.{+4 decls}
  extends AnyRef
example.Example.main(Array). => method main: (args: Array[String]): Unit
  args => example.Example.main(Array).(args)
  Array => scala.Array#
  String => scala.Predef.String#
  Unit => scala.Unit#
example.Example.main(Array).(args) => param args: Array[String]
  Array => scala.Array#
  String => scala.Predef.String#
example.Example.x(). => val method x: : ClassTag[Int]
  ClassTag => scala.reflect.ClassTag#
  Int => scala.Int#
example.Example.x. => private[this] val field x: ClassTag[Int]
  ClassTag => scala.reflect.ClassTag#
  Int => scala.Int#

example/local$minusfile.class
-----------------------------

Summary:
Schema => SemanticDB v3
Uri => example/local$minusfile.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
example. => package example
example.`local-file`# => class local-file.{+1 decls}
  extends AnyRef
example.`local-file`#`<init>`(). => primary ctor <init>: (): local-file
  local-file => example.`local-file`#

example/MetacJava.class
-----------------------

Summary:
Schema => SemanticDB v3
Uri => example/MetacJava.class
Text => empty
Language => Scala
Symbols => 18 entries

Symbols:
_root_. => package _root_
example. => package example
example.MetacJava# => class MetacJava.{+15 decls}
  extends AnyRef
example.MetacJava#`<init>`(). => primary ctor <init>: (): MetacJava
  MetacJava => example.MetacJava#
example.MetacJava#coin(). => val method coin: : Coin
  Coin => com.javacp.Coin#
example.MetacJava#coin. => private[this] val field coin: Coin
  Coin => com.javacp.Coin#
example.MetacJava#inner(). => val method inner: : MetacJava
  MetacJava => com.javacp.MetacJava#
example.MetacJava#inner. => private[this] val field inner: MetacJava
  MetacJava => com.javacp.MetacJava#
example.MetacJava#interface(). => val method interface: : Interface
  Interface => com.javacp.Interface#
example.MetacJava#interface. => private[this] val field interface: Interface
  Interface => com.javacp.Interface#
example.MetacJava#nonStatic(). => val method nonStatic: : MetacJava.this.staticInner.NonStatic
  MetacJava => example.MetacJava#
  staticInner => example.MetacJava#staticInner().
  NonStatic => com.javacp.MetacJava.StaticInner.NonStatic#
example.MetacJava#nonStatic. => private[this] val field nonStatic: MetacJava.this.staticInner.NonStatic
  MetacJava => example.MetacJava#
  staticInner => example.MetacJava#staticInner().
  NonStatic => com.javacp.MetacJava.StaticInner.NonStatic#
example.MetacJava#overload1(). => val method overload1: : MetacJava.this.inner.Overload1
  MetacJava => example.MetacJava#
  inner => example.MetacJava#inner().
  Overload1 => com.javacp.MetacJava.Overload1#
example.MetacJava#overload1. => private[this] val field overload1: MetacJava.this.inner.Overload1
  MetacJava => example.MetacJava#
  inner => example.MetacJava#inner().
  Overload1 => com.javacp.MetacJava.Overload1#
example.MetacJava#overload2(). => val method overload2: : MetacJava.this.inner.Overload2
  MetacJava => example.MetacJava#
  inner => example.MetacJava#inner().
  Overload2 => com.javacp.MetacJava.Overload2#
example.MetacJava#overload2. => private[this] val field overload2: MetacJava.this.inner.Overload2
  MetacJava => example.MetacJava#
  inner => example.MetacJava#inner().
  Overload2 => com.javacp.MetacJava.Overload2#
example.MetacJava#staticInner(). => val method staticInner: : StaticInner
  StaticInner => com.javacp.MetacJava.StaticInner#
example.MetacJava#staticInner. => private[this] val field staticInner: StaticInner
  StaticInner => com.javacp.MetacJava.StaticInner#

example/Methods.class
---------------------

Summary:
Schema => SemanticDB v3
Uri => example/Methods.class
Text => empty
Language => Scala
Symbols => 63 entries

Symbols:
_root_. => package _root_
example. => package example
example.Methods# => class Methods[T >: Nothing <: Any].{+29 decls}
  extends AnyRef
example.Methods#AList# => type AList: [T >: Nothing <: Any] => >: Methods.this.List[T] <: Methods.this.List[T]
  T => example.Methods#AList#[T]
  Nothing => scala.Nothing#
  Any => scala.Any#
  Methods => example.Methods#
  List => example.Methods#List#
example.Methods#AList#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#List# => class List[T >: Nothing <: Any].{+2 decls}
  extends AnyRef
example.Methods#List#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#List#`<init>`(). => primary ctor <init>: (): Methods.this.List[T]
  Methods => example.Methods#
  List => example.Methods#List#
  T => example.Methods#List#[T]
example.Methods#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#`<init>`(). => primary ctor <init>: (): Methods[T]
  Methods => example.Methods#
  T => example.Methods#[T]
example.Methods#`<refinement>`# => class <refinement>
example.Methods#`<refinement>`# => class <refinement>
example.Methods#`<refinement>`#x(). => abstract val method x: : Int
  Int => scala.Int#
example.Methods#`m8().`(). => method m8().: (): Nothing
  Nothing => scala.Nothing#
example.Methods#`m9().`# => class m9()..{+1 decls}
  extends AnyRef
example.Methods#`m9().`#`<init>`(). => primary ctor <init>: (): Methods.this.m9().
  Methods => example.Methods#
  m9(). => example.Methods#`m9().`#
example.Methods#m1(). => method m1: : Nothing
  Nothing => scala.Nothing#
example.Methods#m10(AList). => method m10: (x: Methods.this.AList[T]): Nothing
  x => example.Methods#m10(AList).(x)
  Methods => example.Methods#
  AList => example.Methods#AList#
  T => example.Methods#[T]
  Nothing => scala.Nothing#
example.Methods#m10(AList).(x) => param x: Methods.this.AList[T]
  Methods => example.Methods#
  AList => example.Methods#AList#
  T => example.Methods#[T]
example.Methods#m11(.type+1). => method m11: (x: Predef.type): Nothing
  x => example.Methods#m11(.type+1).(x)
  Predef => scala.Predef.
  Nothing => scala.Nothing#
example.Methods#m11(.type+1).(x) => param x: Predef.type
  Predef => scala.Predef.
example.Methods#m11(.type+2). => method m11: (x: Example.type): Nothing
  x => example.Methods#m11(.type+2).(x)
  Example => example.Example.
  Nothing => scala.Nothing#
example.Methods#m11(.type+2).(x) => param x: Example.type
  Example => example.Example.
example.Methods#m12a({}). => method m12a: (x: AnyRef {}): Nothing
  x => example.Methods#m12a({}).(x)
  AnyRef => scala.AnyRef#
  Nothing => scala.Nothing#
example.Methods#m12a({}).(x) => param x: AnyRef {}
  AnyRef => scala.AnyRef#
example.Methods#m12b({}). => method m12b: (x: AnyRef { val method x: Int }): Nothing
  x => example.Methods#m12b({}).(x)
  AnyRef => scala.AnyRef#
  x => example.Methods#`<refinement>`#x().
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m12b({}).(x) => param x: AnyRef { val method x: Int }
  AnyRef => scala.AnyRef#
  x => example.Methods#`<refinement>`#x().
  Int => scala.Int#
example.Methods#m13(Int). => method m13: (x: Int): Nothing
  x => example.Methods#m13(Int).(x)
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m13(Int).(x) => param x: Int
  Int => scala.Int#
example.Methods#m14(T). => method m14: (x: T forSome { type T >: Nothing <: Any }): Nothing
  x => example.Methods#m14(T).(x)
  T => example.Methods#m14(T).(x)T#
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#m14(T).(x) => param x: T forSome { type T >: Nothing <: Any }
  T => example.Methods#m14(T).(x)T#
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#m14(T).(x)T# => abstract type T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#m15(=>Int). => method m15: (x: => Int): Nothing
  x => example.Methods#m15(=>Int).(x)
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m15(=>Int).(x) => param x: => Int
  Int => scala.Int#
example.Methods#m16(Int*). => method m16: (x: Int*): Nothing
  x => example.Methods#m16(Int*).(x)
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m16(Int*).(x) => param x: Int*
  Int => scala.Int#
example.Methods#m2(). => method m2: (): Nothing
  Nothing => scala.Nothing#
example.Methods#m3(Int). => method m3: (x: Int): Nothing
  x => example.Methods#m3(Int).(x)
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m3(Int).(x) => param x: Int
  Int => scala.Int#
example.Methods#m4(Int,Int). => method m4: (x: Int)(y: Int): Nothing
  x => example.Methods#m4(Int,Int).(x)
  Int => scala.Int#
  y => example.Methods#m4(Int,Int).(y)
  Nothing => scala.Nothing#
example.Methods#m4(Int,Int).(x) => param x: Int
  Int => scala.Int#
example.Methods#m4(Int,Int).(y) => param y: Int
  Int => scala.Int#
example.Methods#m5(Int). => method m5: (x: Int): Nothing
  x => example.Methods#m5(Int).(x)
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m5(Int).(x) => param x: Int
  Int => scala.Int#
example.Methods#m5(String). => method m5: (x: String): Nothing
  x => example.Methods#m5(String).(x)
  String => scala.Predef.String#
  Nothing => scala.Nothing#
example.Methods#m5(String).(x) => param x: String
  String => scala.Predef.String#
example.Methods#m6(Int). => method m6: (x: Int): Nothing
  x => example.Methods#m6(Int).(x)
  Int => scala.Int#
  Nothing => scala.Nothing#
example.Methods#m6(Int).(x) => param x: Int
  Int => scala.Int#
example.Methods#m6(List+1). => method m6: (x: Methods.this.List[T]): Nothing
  x => example.Methods#m6(List+1).(x)
  Methods => example.Methods#
  List => example.Methods#List#
  T => example.Methods#[T]
  Nothing => scala.Nothing#
example.Methods#m6(List+1).(x) => param x: Methods.this.List[T]
  Methods => example.Methods#
  List => example.Methods#List#
  T => example.Methods#[T]
example.Methods#m6(List+2). => method m6: (x: List[T]): Nothing
  x => example.Methods#m6(List+2).(x)
  List => scala.package.List#
  T => example.Methods#[T]
  Nothing => scala.Nothing#
example.Methods#m6(List+2).(x) => param x: List[T]
  List => scala.package.List#
  T => example.Methods#[T]
example.Methods#m7a(Methods,List,Ordering). => method m7a: [U >: Nothing <: Any] => (c: Methods[T], l: Methods.this.List[U])(evidence$1: Ordering[U]): Nothing
  U => example.Methods#m7a(Methods,List,Ordering).[U]
  Nothing => scala.Nothing#
  Any => scala.Any#
  c => example.Methods#m7a(Methods,List,Ordering).(c)
  Methods => example.Methods#
  T => example.Methods#[T]
  l => example.Methods#m7a(Methods,List,Ordering).(l)
  List => example.Methods#List#
  evidence$1 => example.Methods#m7a(Methods,List,Ordering).(evidence$1)
  Ordering => scala.math.Ordering#
example.Methods#m7a(Methods,List,Ordering).(c) => param c: Methods[T]
  Methods => example.Methods#
  T => example.Methods#[T]
example.Methods#m7a(Methods,List,Ordering).(evidence$1) => implicit param evidence$1: Ordering[U]
  Ordering => scala.math.Ordering#
  U => example.Methods#m7a(Methods,List,Ordering).[U]
example.Methods#m7a(Methods,List,Ordering).(l) => param l: Methods.this.List[U]
  Methods => example.Methods#
  List => example.Methods#List#
  U => example.Methods#m7a(Methods,List,Ordering).[U]
example.Methods#m7a(Methods,List,Ordering).[U] => typeparam U: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#m7b(List,Function1). => method m7b: [U >: Nothing <: Any] => (l: Methods.this.List[U])(evidence$2: Function1[U, T]): Nothing
  U => example.Methods#m7b(List,Function1).[U]
  Nothing => scala.Nothing#
  Any => scala.Any#
  l => example.Methods#m7b(List,Function1).(l)
  Methods => example.Methods#
  List => example.Methods#List#
  evidence$2 => example.Methods#m7b(List,Function1).(evidence$2)
  Function1 => scala.Function1#
  T => example.Methods#[T]
example.Methods#m7b(List,Function1).(evidence$2) => implicit param evidence$2: Function1[U, T]
  Function1 => scala.Function1#
  U => example.Methods#m7b(List,Function1).[U]
  T => example.Methods#[T]
example.Methods#m7b(List,Function1).(l) => param l: Methods.this.List[U]
  Methods => example.Methods#
  List => example.Methods#List#
  U => example.Methods#m7b(List,Function1).[U]
example.Methods#m7b(List,Function1).[U] => typeparam U: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
example.Methods#m9(`m9().`). => method m9: (x: Methods.this.m9().): Nothing
  x => example.Methods#m9(`m9().`).(x)
  Methods => example.Methods#
  m9(). => example.Methods#`m9().`#
  Nothing => scala.Nothing#
example.Methods#m9(`m9().`).(x) => param x: Methods.this.m9().
  Methods => example.Methods#
  m9(). => example.Methods#`m9().`#

example/MethodUsages.class
--------------------------

Summary:
Schema => SemanticDB v3
Uri => example/MethodUsages.class
Text => empty
Language => Scala
Symbols => 6 entries

Symbols:
_root_. => package _root_
example. => package example
example.MethodUsages# => class MethodUsages.{+3 decls}
  extends AnyRef
example.MethodUsages#`<init>`(). => primary ctor <init>: (): MethodUsages
  MethodUsages => example.MethodUsages#
example.MethodUsages#m(). => val method m: : Methods[Int]
  Methods => example.Methods#
  Int => scala.Int#
example.MethodUsages#m. => private[this] val field m: Methods[Int]
  Methods => example.Methods#
  Int => scala.Int#

example/Synthetic.class
-----------------------

Summary:
Schema => SemanticDB v3
Uri => example/Synthetic.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
example. => package example
example.Synthetic# => class Synthetic.{+1 decls}
  extends AnyRef
example.Synthetic#`<init>`(). => primary ctor <init>: (): Synthetic
  Synthetic => example.Synthetic#

example/Vals.class
------------------

Summary:
Schema => SemanticDB v3
Uri => example/Vals.class
Text => empty
Language => Scala
Symbols => 41 entries

Symbols:
_root_. => package _root_
example. => package example
example.Vals# => abstract class Vals.{+30 decls}
  extends AnyRef
example.Vals#`<init>`(Int,Int,Int). => primary ctor <init>: (p: Int, val xp: Int, var yp: Int): Vals
  p => example.Vals#`<init>`(Int,Int,Int).(p)
  Int => scala.Int#
  xp => example.Vals#`<init>`(Int,Int,Int).(xp)
  yp => example.Vals#`<init>`(Int,Int,Int).(yp)
  Vals => example.Vals#
example.Vals#`<init>`(Int,Int,Int).(p) => param p: Int
  Int => scala.Int#
example.Vals#`<init>`(Int,Int,Int).(xp) => val param xp: Int
  Int => scala.Int#
example.Vals#`<init>`(Int,Int,Int).(yp) => var param yp: Int
  Int => scala.Int#
example.Vals#`yam_=`(Int). => abstract var method yam_=: (x$1: Int): Unit
  x$1 => example.Vals#`yam_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
example.Vals#`yam_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
example.Vals#`yfm_=`(Int). => final var method yfm_=: (x$1: Int): Unit
  x$1 => example.Vals#`yfm_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
example.Vals#`yfm_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
example.Vals#`yim_=`(Int). => var method yim_=: (x$1: Int): Unit
  x$1 => example.Vals#`yim_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
example.Vals#`yim_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
example.Vals#`ym_=`(Int). => var method ym_=: (x$1: Int): Unit
  x$1 => example.Vals#`ym_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
example.Vals#`ym_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
example.Vals#`yp_=`(Int). => var method yp_=: (x$1: Int): Unit
  x$1 => example.Vals#`yp_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
example.Vals#`yp_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
example.Vals#m(). => method m: : Unit
  Unit => scala.Unit#
example.Vals#p. => private[this] val field p: Int
  Int => scala.Int#
example.Vals#xam(). => abstract val method xam: : Int
  Int => scala.Int#
example.Vals#xfm(). => final val method xfm: : Int
  Int => scala.Int#
example.Vals#xfm. => private[this] final val field xfm: Int
  Int => scala.Int#
example.Vals#xim(). => implicit val method xim: : Int
  Int => scala.Int#
example.Vals#xim. => private[this] val field xim: Int
  Int => scala.Int#
example.Vals#xlm. => private[this] val field xlm: Int
  Int => scala.Int#
example.Vals#xm(). => val method xm: : Int
  Int => scala.Int#
example.Vals#xm. => private[this] val field xm: Int
  Int => scala.Int#
example.Vals#xp(). => val method xp: : Int
  Int => scala.Int#
example.Vals#xp. => private[this] val field xp: Int
  Int => scala.Int#
example.Vals#xzlm(). => private[this] lazy val method xzlm: : Int
  Int => scala.Int#
example.Vals#xzm(). => lazy val method xzm: : Int
  Int => scala.Int#
example.Vals#yam(). => abstract var method yam: : Int
  Int => scala.Int#
example.Vals#yfm(). => final var method yfm: : Int
  Int => scala.Int#
example.Vals#yfm. => private[this] final var field yfm: Int
  Int => scala.Int#
example.Vals#yim(). => implicit var method yim: : Int
  Int => scala.Int#
example.Vals#yim. => private[this] var field yim: Int
  Int => scala.Int#
example.Vals#ylm. => private[this] var field ylm: Int
  Int => scala.Int#
example.Vals#ym(). => var method ym: : Int
  Int => scala.Int#
example.Vals#ym. => private[this] var field ym: Int
  Int => scala.Int#
example.Vals#yp(). => var method yp: : Int
  Int => scala.Int#
example.Vals#yp. => private[this] var field yp: Int
  Int => scala.Int#

example/ValUsages.class
-----------------------

Summary:
Schema => SemanticDB v3
Uri => example/ValUsages.class
Text => empty
Language => Scala
Symbols => 5 entries

Symbols:
_root_. => package _root_
example. => package example
example.ValUsages. => final object ValUsages.{+3 decls}
  extends AnyRef
example.ValUsages.v(). => val method v: : Vals
  Vals => example.Vals#
example.ValUsages.v. => private[this] val field v: Vals
  Vals => example.Vals#

exclude/Exclude.class
---------------------

Summary:
Schema => SemanticDB v3
Uri => exclude/Exclude.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
exclude. => package exclude
exclude.Exclude# => class Exclude.{+1 decls}
  extends AnyRef
exclude.Exclude#`<init>`(). => primary ctor <init>: (): Exclude
  Exclude => exclude.Exclude#

flags/p/package.class
---------------------

Summary:
Schema => SemanticDB v3
Uri => flags/p/package.class
Text => empty
Language => Scala
Symbols => 62 entries

Symbols:
_root_. => package _root_
flags. => package flags
flags.p. => package p
flags.p.package. => final package object package.{+20 decls}
  extends AnyRef
flags.p.package.AA# => class AA.{+7 decls}
  extends AnyRef
flags.p.package.AA#`<init>`(Int,Int,Int). => primary ctor <init>: (x: Int, val y: Int, var z: Int): AA
  x => flags.p.package.AA#`<init>`(Int,Int,Int).(x)
  Int => scala.Int#
  y => flags.p.package.AA#`<init>`(Int,Int,Int).(y)
  z => flags.p.package.AA#`<init>`(Int,Int,Int).(z)
  AA => flags.p.package.AA#
flags.p.package.AA#`<init>`(Int,Int,Int).(x) => param x: Int
  Int => scala.Int#
flags.p.package.AA#`<init>`(Int,Int,Int).(y) => val param y: Int
  Int => scala.Int#
flags.p.package.AA#`<init>`(Int,Int,Int).(z) => var param z: Int
  Int => scala.Int#
flags.p.package.AA#`z_=`(Int). => var method z_=: (x$1: Int): Unit
  x$1 => flags.p.package.AA#`z_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
flags.p.package.AA#`z_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
flags.p.package.AA#x. => private[this] val field x: Int
  Int => scala.Int#
flags.p.package.AA#y(). => val method y: : Int
  Int => scala.Int#
flags.p.package.AA#y. => private[this] val field y: Int
  Int => scala.Int#
flags.p.package.AA#z(). => var method z: : Int
  Int => scala.Int#
flags.p.package.AA#z. => private[this] var field z: Int
  Int => scala.Int#
flags.p.package.C# => abstract class C[+T >: Nothing <: Any, -U >: Nothing <: Any, V >: Nothing <: Any].{+9 decls}
  extends AnyRef
flags.p.package.C#[T] => covariant typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.C#[U] => contravariant typeparam U: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.C#[V] => typeparam V: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.C#`<init>`(). => ctor <init>: (): C[T, U, V]
  C => flags.p.package.C#
  T => flags.p.package.C#[T]
  U => flags.p.package.C#[U]
  V => flags.p.package.C#[V]
flags.p.package.C#`<init>`(T,U,V). => primary ctor <init>: (x: T, y: U, z: V): C[T, U, V]
  x => flags.p.package.C#`<init>`(T,U,V).(x)
  T => flags.p.package.C#[T]
  y => flags.p.package.C#`<init>`(T,U,V).(y)
  U => flags.p.package.C#[U]
  z => flags.p.package.C#`<init>`(T,U,V).(z)
  V => flags.p.package.C#[V]
  C => flags.p.package.C#
flags.p.package.C#`<init>`(T,U,V).(x) => param x: T
  T => flags.p.package.C#[T]
flags.p.package.C#`<init>`(T,U,V).(y) => param y: U
  U => flags.p.package.C#[U]
flags.p.package.C#`<init>`(T,U,V).(z) => param z: V
  V => flags.p.package.C#[V]
flags.p.package.C#w(). => abstract method w: : Int
  Int => scala.Int#
flags.p.package.C#x. => private[this] val field x: T
  T => flags.p.package.C#[T]
flags.p.package.C#y. => private[this] val field y: U
  U => flags.p.package.C#[U]
flags.p.package.C#z. => private[this] val field z: V
  V => flags.p.package.C#[V]
flags.p.package.S# => class S[T >: Nothing <: Any].{+2 decls}
  extends AnyRef
flags.p.package.S#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.S#`<init>`(). => primary ctor <init>: (): S[T]
  S => flags.p.package.S#
  T => flags.p.package.S#[T]
flags.p.package.T1# => type T1: >: Int <: Int
  Int => scala.Int#
flags.p.package.T2# => type T2: [T >: Nothing <: Any] => >: S[T] <: S[T]
  T => flags.p.package.T2#[T]
  Nothing => scala.Nothing#
  Any => scala.Any#
  S => flags.p.package.S#
flags.p.package.T2#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.U# => abstract type U: >: Nothing <: Int
  Nothing => scala.Nothing#
  Int => scala.Int#
flags.p.package.V# => abstract type V: >: Int <: Any
  Int => scala.Int#
  Any => scala.Any#
flags.p.package.X. => final case object X.{+9 decls}
  extends AnyRef
  extends Product
  extends Serializable
flags.p.package.X.canEqual(Any). => method canEqual: (x$1: Any): Boolean
  x$1 => flags.p.package.X.canEqual(Any).(x$1)
  Any => scala.Any#
  Boolean => scala.Boolean#
flags.p.package.X.canEqual(Any).(x$1) => param x$1: Any
  Any => scala.Any#
flags.p.package.X.hashCode(). => method hashCode: (): Int
  Int => scala.Int#
flags.p.package.X.productArity(). => method productArity: : Int
  Int => scala.Int#
flags.p.package.X.productElement(Int). => method productElement: (x$1: Int): Any
  x$1 => flags.p.package.X.productElement(Int).(x$1)
  Int => scala.Int#
  Any => scala.Any#
flags.p.package.X.productElement(Int).(x$1) => param x$1: Int
  Int => scala.Int#
flags.p.package.X.productIterator(). => method productIterator: : Iterator[Any]
  Iterator => scala.collection.Iterator#
  Any => scala.Any#
flags.p.package.X.productPrefix(). => method productPrefix: : String
  String => java.lang.String#
flags.p.package.X.readResolve(). => private method readResolve: (): Object
  Object => java.lang.Object#
flags.p.package.X.toString(). => method toString: (): String
  String => java.lang.String#
flags.p.package.Y# => final class Y.{+1 decls}
  extends AnyRef
flags.p.package.Y#`<init>`(). => primary ctor <init>: (): Y
  Y => flags.p.package.Y#
flags.p.package.Z# => sealed trait Z
  extends AnyRef
flags.p.package.`y_=`(Int). => protected var method y_=: (x$1: Int): Unit
  x$1 => flags.p.package.`y_=`(Int).(x$1)
  Int => scala.Int#
  Unit => scala.Unit#
flags.p.package.`y_=`(Int).(x$1) => param x$1: Int
  Int => scala.Int#
flags.p.package.m(). => macro m: [TT >: Nothing <: Any] => : Nothing
  TT => flags.p.package.m().[TT]
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.m().[TT] => typeparam TT: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
flags.p.package.x(). => private lazy val method x: : Int
  Int => scala.Int#
flags.p.package.xs1(). => val method xs1: : Nothing
  Nothing => scala.Nothing#
flags.p.package.xs1. => private[this] val field xs1: Nothing
  Nothing => scala.Nothing#
flags.p.package.y(). => protected implicit var method y: : Int
  Int => scala.Int#
flags.p.package.y. => private[this] var field y: Int
  Int => scala.Int#
flags.p.package.z(Int). => method z: (pp: Int): Int
  pp => flags.p.package.z(Int).(pp)
  Int => scala.Int#
flags.p.package.z(Int).(pp) => param pp: Int
  Int => scala.Int#

types/ann.class
---------------

Summary:
Schema => SemanticDB v3
Uri => types/ann.class
Text => empty
Language => Scala
Symbols => 7 entries

Symbols:
_root_. => package _root_
types. => package types
types.ann# => class ann[T >: Nothing <: Any].{+3 decls}
  extends Annotation
  extends StaticAnnotation
types.ann#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.ann#`<init>`(T). => primary ctor <init>: (x: T): ann[T]
  x => types.ann#`<init>`(T).(x)
  T => types.ann#[T]
  ann => types.ann#
types.ann#`<init>`(T).(x) => param x: T
  T => types.ann#[T]
types.ann#x. => private[this] val field x: T
  T => types.ann#[T]

types/ann1.class
----------------

Summary:
Schema => SemanticDB v3
Uri => types/ann1.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
types. => package types
types.ann1# => class ann1.{+1 decls}
  extends Annotation
  extends StaticAnnotation
types.ann1#`<init>`(). => primary ctor <init>: (): ann1
  ann1 => types.ann1#

types/ann2.class
----------------

Summary:
Schema => SemanticDB v3
Uri => types/ann2.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
types. => package types
types.ann2# => class ann2.{+1 decls}
  extends Annotation
  extends StaticAnnotation
types.ann2#`<init>`(). => primary ctor <init>: (): ann2
  ann2 => types.ann2#

types/B.class
-------------

Summary:
Schema => SemanticDB v3
Uri => types/B.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
types. => package types
types.B# => class B.{+1 decls}
  extends AnyRef
types.B#`<init>`(). => primary ctor <init>: (): B
  B => types.B#

types/C.class
-------------

Summary:
Schema => SemanticDB v3
Uri => types/C.class
Text => empty
Language => Scala
Symbols => 4 entries

Symbols:
_root_. => package _root_
types. => package types
types.C# => class C.{+1 decls}
  extends AnyRef
types.C#`<init>`(). => primary ctor <init>: (): C
  C => types.C#

types/P.class
-------------

Summary:
Schema => SemanticDB v3
Uri => types/P.class
Text => empty
Language => Scala
Symbols => 10 entries

Symbols:
_root_. => package _root_
types. => package types
types.P# => class P.{+5 decls}
  extends AnyRef
types.P#C# => class C.{+1 decls}
  extends AnyRef
types.P#C#`<init>`(). => primary ctor <init>: (): P.this.C
  P => types.P#
  C => types.P#C#
types.P#X# => class X.{+1 decls}
  extends AnyRef
types.P#X#`<init>`(). => primary ctor <init>: (): P.this.X
  P => types.P#
  X => types.P#X#
types.P#`<init>`(). => primary ctor <init>: (): P
  P => types.P#
types.P#x(). => val method x: : P.this.X
  P => types.P#
  X => types.P#X#
types.P#x. => private[this] val field x: P.this.X
  P => types.P#
  X => types.P#X#

types/T.class
-------------

Summary:
Schema => SemanticDB v3
Uri => types/T.class
Text => empty
Language => Scala
Symbols => 10 entries

Symbols:
_root_. => package _root_
types. => package types
types.T# => class T.{+5 decls}
  extends AnyRef
types.T#C# => class C.{+1 decls}
  extends AnyRef
types.T#C#`<init>`(). => primary ctor <init>: (): T.this.C
  T => types.T#
  C => types.T#C#
types.T#X# => class X.{+1 decls}
  extends AnyRef
types.T#X#`<init>`(). => primary ctor <init>: (): T.this.X
  T => types.T#
  X => types.T#X#
types.T#`<init>`(). => primary ctor <init>: (): T
  T => types.T#
types.T#x(). => val method x: : T.this.X
  T => types.T#
  X => types.T#X#
types.T#x. => private[this] val field x: T.this.X
  T => types.T#
  X => types.T#X#

types/Test.class
----------------

Summary:
Schema => SemanticDB v3
Uri => types/Test.class
Text => empty
Language => Scala
Symbols => 134 entries

Symbols:
_root_. => package _root_
types. => package types
types.Test. => final object Test.{+6 decls}
  extends AnyRef
types.Test.C# => class C.{+56 decls}
  extends M
types.Test.C#ByNameType. => final object ByNameType.{+2 decls}
  extends AnyRef
types.Test.C#ByNameType.m1(=>Int). => method m1: (x: => Int): Int
  x => types.Test.C#ByNameType.m1(=>Int).(x)
  Int => scala.Int#
types.Test.C#ByNameType.m1(=>Int).(x) => param x: => Int
  Int => scala.Int#
types.Test.C#ClassInfoType1. => final object ClassInfoType1.{+1 decls}
  extends AnyRef
types.Test.C#ClassInfoType2# => class ClassInfoType2.{+2 decls}
  extends B
types.Test.C#ClassInfoType2#`<init>`(). => primary ctor <init>: (): C.this.ClassInfoType2
  C => types.Test.C#
  ClassInfoType2 => types.Test.C#ClassInfoType2#
types.Test.C#ClassInfoType2#x(). => method x: : Int
  Int => scala.Int#
types.Test.C#ClassInfoType3# => trait ClassInfoType3[T >: Nothing <: Any].{+1 decls}
  extends AnyRef
types.Test.C#ClassInfoType3#[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#MethodType. => final object MethodType.{+7 decls}
  extends AnyRef
types.Test.C#MethodType.m3(). => method m3: : Int
  Int => scala.Int#
types.Test.C#MethodType.m4(). => method m4: (): Int
  Int => scala.Int#
types.Test.C#MethodType.m5(Int). => method m5: (x: Int): Int
  x => types.Test.C#MethodType.m5(Int).(x)
  Int => scala.Int#
types.Test.C#MethodType.m5(Int).(x) => param x: Int
  Int => scala.Int#
types.Test.C#MethodType.m6(T). => method m6: [T >: Nothing <: Any] => (x: T): T
  T => types.Test.C#MethodType.m6(T).[T]
  Nothing => scala.Nothing#
  Any => scala.Any#
  x => types.Test.C#MethodType.m6(T).(x)
types.Test.C#MethodType.m6(T).(x) => param x: T
  T => types.Test.C#MethodType.m6(T).[T]
types.Test.C#MethodType.m6(T).[T] => typeparam T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#MethodType.x1(). => method x1: : Int
  Int => scala.Int#
types.Test.C#MethodType.x2(). => method x2: : Int
  Int => scala.Int#
types.Test.C#RepeatedType# => case class RepeatedType.{+12 decls}
  extends AnyRef
  extends Product
  extends Serializable
types.Test.C#RepeatedType#`<init>`(String*). => primary ctor <init>: (val s: String*): C.this.RepeatedType
  s => types.Test.C#RepeatedType#`<init>`(String*).(s)
  String => scala.Predef.String#
  C => types.Test.C#
  RepeatedType => types.Test.C#RepeatedType#
types.Test.C#RepeatedType#`<init>`(String*).(s) => val param s: String*
  String => scala.Predef.String#
types.Test.C#RepeatedType#canEqual(Any). => method canEqual: (x$1: Any): Boolean
  x$1 => types.Test.C#RepeatedType#canEqual(Any).(x$1)
  Any => scala.Any#
  Boolean => scala.Boolean#
types.Test.C#RepeatedType#canEqual(Any).(x$1) => param x$1: Any
  Any => scala.Any#
types.Test.C#RepeatedType#equals(Any). => method equals: (x$1: Any): Boolean
  x$1 => types.Test.C#RepeatedType#equals(Any).(x$1)
  Any => scala.Any#
  Boolean => scala.Boolean#
types.Test.C#RepeatedType#equals(Any).(x$1) => param x$1: Any
  Any => scala.Any#
types.Test.C#RepeatedType#hashCode(). => method hashCode: (): Int
  Int => scala.Int#
types.Test.C#RepeatedType#m1(Int*). => method m1: (x: Int*): Int
  x => types.Test.C#RepeatedType#m1(Int*).(x)
  Int => scala.Int#
types.Test.C#RepeatedType#m1(Int*).(x) => param x: Int*
  Int => scala.Int#
types.Test.C#RepeatedType#productArity(). => method productArity: : Int
  Int => scala.Int#
types.Test.C#RepeatedType#productElement(Int). => method productElement: (x$1: Int): Any
  x$1 => types.Test.C#RepeatedType#productElement(Int).(x$1)
  Int => scala.Int#
  Any => scala.Any#
types.Test.C#RepeatedType#productElement(Int).(x$1) => param x$1: Int
  Int => scala.Int#
types.Test.C#RepeatedType#productIterator(). => method productIterator: : Iterator[Any]
  Iterator => scala.collection.Iterator#
  Any => scala.Any#
types.Test.C#RepeatedType#productPrefix(). => method productPrefix: : String
  String => java.lang.String#
types.Test.C#RepeatedType#s(). => val method s: : String*
  String => scala.Predef.String#
types.Test.C#RepeatedType#s. => private[this] val field s: String*
  String => scala.Predef.String#
types.Test.C#RepeatedType#toString(). => method toString: (): String
  String => java.lang.String#
types.Test.C#RepeatedType. => final object RepeatedType.{+4 decls}
  extends AbstractFunction1[String*, C.this.RepeatedType]
  extends Serializable
types.Test.C#RepeatedType.apply(String*). => case method apply: (s: String*): C.this.RepeatedType
  s => types.Test.C#RepeatedType.apply(String*).(s)
  String => scala.Predef.String#
  C => types.Test.C#
  RepeatedType => types.Test.C#RepeatedType#
types.Test.C#RepeatedType.apply(String*).(s) => param s: String*
  String => scala.Predef.String#
types.Test.C#RepeatedType.toString(). => final method toString: (): String
  String => java.lang.String#
types.Test.C#RepeatedType.unapplySeq(RepeatedType). => case method unapplySeq: (x$0: C.this.RepeatedType): Option[Seq[String]]
  x$0 => types.Test.C#RepeatedType.unapplySeq(RepeatedType).(x$0)
  C => types.Test.C#
  RepeatedType => types.Test.C#RepeatedType#
  Option => scala.Option#
  Seq => scala.package.Seq#
  String => scala.Predef.String#
types.Test.C#RepeatedType.unapplySeq(RepeatedType).(x$0) => param x$0: C.this.RepeatedType
  C => types.Test.C#
  RepeatedType => types.Test.C#RepeatedType#
types.Test.C#TypeType. => final object TypeType.{+6 decls}
  extends AnyRef
types.Test.C#TypeType.T1# => abstract type T1: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#TypeType.T4# => type T4: >: C <: C
  C => types.Test.C#
types.Test.C#TypeType.T5# => type T5: [U >: Nothing <: Any] => >: U <: U
  U => types.Test.C#TypeType.T5#[U]
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#TypeType.T5#[U] => typeparam U: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#TypeType.m2(). => method m2: [T2 >: C <: C] => : Nothing
  T2 => types.Test.C#TypeType.m2().[T2]
  C => types.Test.C#
  Nothing => scala.Nothing#
types.Test.C#TypeType.m2().[T2] => typeparam T2: >: C <: C
  C => types.Test.C#
types.Test.C#TypeType.m3(). => method m3: [M3 [_ >: Nothing <: Any] => >: Nothing <: Any] => : Nothing
  M3 => types.Test.C#TypeType.m3().[M3]
  _ => types.Test.C#TypeType.m3().[M3][_]
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#TypeType.m3().[M3] => typeparam M3: [_ >: Nothing <: Any] => >: Nothing <: Any
  _ => types.Test.C#TypeType.m3().[M3][_]
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#TypeType.m3().[M3][_] => typeparam _: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#`<init>`(). => primary ctor <init>: (): C
  C => types.Test.C#
types.Test.C#`<refinement>`# => class <refinement>
types.Test.C#`<refinement>`# => class <refinement>
types.Test.C#`<refinement>`# => class <refinement>
types.Test.C#`<refinement>`#k(). => abstract method k: : Int
  Int => scala.Int#
types.Test.C#`<refinement>`#k(). => abstract method k: : Int
  Int => scala.Int#
types.Test.C#annType1(). => val method annType1: : T 
  T => types.T#
types.Test.C#annType1. => private[this] val field annType1: T 
  T => types.T#
types.Test.C#annType2(). => val method annType2: : T 
  T => types.T#
types.Test.C#annType2. => private[this] val field annType2: T 
  T => types.T#
types.Test.C#compoundType1(). => val method compoundType1: : AnyRef { method k: Int }
  AnyRef => scala.AnyRef#
  k => types.Test.C#`<refinement>`#k().
  Int => scala.Int#
types.Test.C#compoundType1. => private[this] val field compoundType1: AnyRef { method k: Int }
  AnyRef => scala.AnyRef#
  k => types.Test.C#`<refinement>`#k().
  Int => scala.Int#
types.Test.C#compoundType2(). => val method compoundType2: : M with N {}
  M => types.Test.M#
  N => types.Test.N#
types.Test.C#compoundType2. => private[this] val field compoundType2: M with N {}
  M => types.Test.M#
  N => types.Test.N#
types.Test.C#compoundType3(). => val method compoundType3: : M with N { method k: Int }
  M => types.Test.M#
  N => types.Test.N#
  k => types.Test.C#`<refinement>`#k().
  Int => scala.Int#
types.Test.C#compoundType3. => private[this] val field compoundType3: M with N { method k: Int }
  M => types.Test.M#
  N => types.Test.N#
  k => types.Test.C#`<refinement>`#k().
  Int => scala.Int#
types.Test.C#existentialType1(). => val method existentialType1: : T forSome { type T >: Nothing <: Any }
  T => types.Test.C#existentialType1.T#
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#existentialType1. => private[this] val field existentialType1: T forSome { type T >: Nothing <: Any }
  T => types.Test.C#existentialType1.T#
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#existentialType1.T# => abstract type T: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#p(). => val method p: : P
  P => types.P#
types.Test.C#p. => private[this] val field p: P
  P => types.P#
types.Test.C#singleType1(). => val method singleType1: : C.this.x.type
  C => types.Test.C#
  x => types.Test.C#x().
types.Test.C#singleType1. => private[this] val field singleType1: C.this.x.type
  C => types.Test.C#
  x => types.Test.C#x().
types.Test.C#singleType2(). => val method singleType2: : C.this.p.x.type
  C => types.Test.C#
  p => types.Test.C#p().
  x => types.P.x#
types.Test.C#singleType2. => private[this] val field singleType2: C.this.p.x.type
  C => types.Test.C#
  p => types.Test.C#p().
  x => types.P.x#
types.Test.C#superType1(). => val method superType1: : Int
  Int => scala.Int#
types.Test.C#superType1. => private[this] val field superType1: Int
  Int => scala.Int#
types.Test.C#superType2(). => val method superType2: : Int
  Int => scala.Int#
types.Test.C#superType2. => private[this] val field superType2: Int
  Int => scala.Int#
types.Test.C#superType3(). => val method superType3: : Int
  Int => scala.Int#
types.Test.C#superType3. => private[this] val field superType3: Int
  Int => scala.Int#
types.Test.C#thisType1(). => val method thisType1: : C.this.type
  C => types.Test.C#
types.Test.C#thisType1. => private[this] val field thisType1: C.this.type
  C => types.Test.C#
types.Test.C#thisType2(). => val method thisType2: : C.this.type
  C => types.Test.C#
types.Test.C#thisType2. => private[this] val field thisType2: C.this.type
  C => types.Test.C#
types.Test.C#typeLambda1(). => method typeLambda1: [M [_ >: Nothing <: Any] => >: Nothing <: Any] => : Nothing
  M => types.Test.C#typeLambda1().[M]
  _ => types.Test.C#typeLambda1().[M][_]
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#typeLambda1().[M] => typeparam M: [_ >: Nothing <: Any] => >: Nothing <: Any
  _ => types.Test.C#typeLambda1().[M][_]
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#typeLambda1().[M][_] => typeparam _: >: Nothing <: Any
  Nothing => scala.Nothing#
  Any => scala.Any#
types.Test.C#typeRef1(). => val method typeRef1: : C
  C => types.Test.C#
types.Test.C#typeRef1. => private[this] val field typeRef1: C
  C => types.Test.C#
types.Test.C#typeRef2(). => val method typeRef2: : C.this.p.C
  C => types.Test.C#
  p => types.Test.C#p().
  C => types.P.C#
types.Test.C#typeRef2. => private[this] val field typeRef2: C.this.p.C
  C => types.Test.C#
  p => types.Test.C#p().
  C => types.P.C#
types.Test.C#typeRef3(). => val method typeRef3: : T#C
  T => types.T#
  C => types.T.C#
types.Test.C#typeRef3. => private[this] val field typeRef3: T#C
  T => types.T#
  C => types.T.C#
types.Test.C#typeRef4(). => val method typeRef4: : List[Int]
  List => scala.package.List#
  Int => scala.Int#
types.Test.C#typeRef4. => private[this] val field typeRef4: List[Int]
  List => scala.package.List#
  Int => scala.Int#
types.Test.C#x(). => val method x: : C.this.p.X
  C => types.Test.C#
  p => types.Test.C#p().
  X => types.P.X#
types.Test.C#x. => private[this] val field x: C.this.p.X
  C => types.Test.C#
  p => types.Test.C#p().
  X => types.P.X#
types.Test.Literal. => final object Literal.{+23 decls}
  extends AnyRef
types.Test.Literal.bool(). => final val method bool: : true
types.Test.Literal.bool. => private[this] final val field bool: true
types.Test.Literal.char(). => final val method char: : 'a'
types.Test.Literal.char. => private[this] final val field char: 'a'
types.Test.Literal.clazzOf(). => final val method clazzOf: : Class[Option[Int]]
  Class => java.lang.Class#
  Option => scala.Option#
  Int => scala.Int#
types.Test.Literal.clazzOf. => private[this] final val field clazzOf: Class[Option[Int]]
  Class => java.lang.Class#
  Option => scala.Option#
  Int => scala.Int#
types.Test.Literal.double(). => final val method double: : 2.0
types.Test.Literal.double. => private[this] final val field double: 2.0
types.Test.Literal.float(). => final val method float: : 1.0f
types.Test.Literal.float. => private[this] final val field float: 1.0f
types.Test.Literal.int(). => final val method int: : 1
types.Test.Literal.int. => private[this] final val field int: 1
types.Test.Literal.javaEnum(<?>). => final val method javaEnum
types.Test.Literal.javaEnum. => private[this] final val field javaEnum
types.Test.Literal.long(). => final val method long: : 1L
types.Test.Literal.long. => private[this] final val field long: 1L
types.Test.Literal.nil(). => final val method nil: : null
types.Test.Literal.nil. => private[this] final val field nil: null
types.Test.Literal.string(). => final val method string: : "a"
types.Test.Literal.string. => private[this] final val field string: "a"
types.Test.Literal.unit(). => final val method unit: : Unit
  Unit => scala.Unit#
types.Test.Literal.unit. => private[this] final val field unit: Unit
  Unit => scala.Unit#
types.Test.M# => class M.{+2 decls}
  extends AnyRef
types.Test.M#`<init>`(). => primary ctor <init>: (): M
  M => types.Test.M#
types.Test.M#m(). => method m: : Int
  Int => scala.Int#
types.Test.N# => class N.{+2 decls}
  extends AnyRef
types.Test.N#`<init>`(). => primary ctor <init>: (): N
  N => types.Test.N#
types.Test.N#n(). => method n: : Int
  Int => scala.Int#
